mushBrainDave/esp32-p4-imx-camera/examples/imx708_capture/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32p4"

# PSRAM — frame buffers live in SPIRAM (a 2304x1296 RAW10 frame is ~3.7 MB)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y

# 32 MB flash on this board (default image header assumes less)
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y

# esp_video: MIPI-CSI capture device + ISP pipeline
CONFIG_ESP_VIDEO_ENABLE_MIPI_CSI_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_ISP_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y

# IMX708 add-on driver + auto-detect; IMX219 off so it doesn't probe 0x10
CONFIG_CAMERA_IMX708=y
CONFIG_CAMERA_IMX708_AUTO_DETECT_MIPI_INTERFACE_SENSOR=y
CONFIG_CAMERA_IMX219=n

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
